x = (input().lower()).split(" ")
y =[]
i = 0
while i < len(x):
    y.append(x[i])
    i += 1

if len(y) > 0: #x[start:stop] [1:] คือเอาตัวอักษรที่ 1 จนถึงก่อนตัวสุดท้าย ส่วน [0:-1] คือเอาตัวอักษรที่ 0 จนถึงตัวอักษรสุดท้าย
    y[0] = y[0][1:]    #[0][1:] คือเอาเลือก 'THIS แต่เอาตัวอักษรที่ 1 จนถึงสุดท้าย คือเอา ' ออก
    y[-1] = y[-1][:-1] #[-1][:-1] คือเอาเลือก EASY!' แต่เอาตัวอักษรที่1 จนถึงสุดท้าย คือเอา ' ออก
    i = 0
    while i < len(y):
        print(y[i], end=" ")
        i += 1
else:
    print("none")
